Repository: yuval08/template001
Catalog: backend/Infrastructure/Resources/SharedResources.*.resx
Languages: es_es

# Validation.Required
source: This field is required.
es_es: Este campo es obligatorio.

# Validation.Email
source: Please enter a valid email address.
es_es: Por favor, introduzca una dirección de email válida.

# Validation.MinLength
source: This field must be at least {0} characters long.
es_es: Este campo debe tener al menos {0} caracteres.

# Validation.MaxLength
source: This field cannot exceed {0} characters.
es_es: Este campo no puede exceder {0} caracteres.

# Validation.Range
source: Value must be between {0} and {1}.
es_es: El valor debe estar entre {0} y {1}.

# Auth.LoginSuccess
source: Successfully logged in.
es_es: Sesión iniciada correctamente.

# Auth.LogoutSuccess
source: Successfully logged out.
es_es: Sesión cerrada correctamente.

# Auth.InvalidCredentials
source: Invalid email or password.
es_es: Email o contraseña inválidos.

# Auth.AccountLocked
source: Account is locked. Please contact administrator.
es_es: La cuenta está bloqueada. Por favor, contacte al administrador.

# Auth.Unauthorized
source: You are not authorized to perform this action.
es_es: No está autorizado para realizar esta acción.

# General.Success
source: Operation completed successfully.
es_es: Operación completada exitosamente.

# General.Error
source: An error occurred while processing your request.
es_es: Ocurrió un error al procesar su solicitud.

# General.NotFound
source: The requested resource was not found.
es_es: No se encontró el recurso solicitado.

# General.Loading
source: Loading...
es_es: Cargando...

# General.Save
source: Save
es_es: Guardar

# General.Cancel
source: Cancel
es_es: Cancelar

# General.Delete
source: Delete
es_es: Eliminar

# General.Edit
source: Edit
es_es: Editar

# General.Create
source: Create
es_es: Crear

# General.Update
source: Update
es_es: Actualizar

# User.Created
source: User created successfully.
es_es: Usuario creado exitosamente.

# User.Updated
source: User updated successfully.
es_es: Usuario actualizado exitosamente.

# User.Deleted
source: User deleted successfully.
es_es: Usuario eliminado exitosamente.

source: User not found.
es_es: Usuario no encontrado.

# Project.Created
source: Project created successfully.
es_es: Proyecto creado exitosamente.

# Project.Updated
source: Project updated successfully.
es_es: Proyecto actualizado exitosamente.

# Project.Deleted
source: Project deleted successfully.
es_es: Proyecto eliminado exitosamente.

source: Project not found.
es_es: Proyecto no encontrado.

# Email.InvitationSubject
source: You're invited to join {0}
es_es: Está invitado a unirse a {0}

# Email.SendError
source: Failed to send email. Please try again later.
es_es: Error al enviar el email. Por favor, inténtelo más tarde.

# Email.SendSuccess
source: Email sent successfully.
es_es: Email enviado exitosamente.

# Validation.UserDataRequired
source: User data is required.
es_es: Los datos del usuario son obligatorios.

# Validation.EmailRequired
source: Email is required.
es_es: El email es obligatorio.

# Validation.InvalidEmailFormat
source: Invalid email format.
es_es: Formato de email inválido.

# Validation.EmailMaxLength
source: Email must not exceed {0} characters.
es_es: El email no puede exceder {0} caracteres.

# Validation.FirstNameRequired
source: First name is required.
es_es: El nombre es obligatorio.

# Validation.FirstNameMaxLength
source: First name must not exceed {0} characters.
es_es: El nombre no puede exceder {0} caracteres.

# Validation.FirstNameInvalidChars
source: First name contains invalid characters.
es_es: El nombre contiene caracteres inválidos.

# Validation.LastNameRequired
source: Last name is required.
es_es: El apellido es obligatorio.

# Validation.LastNameMaxLength
source: Last name must not exceed {0} characters.
es_es: El apellido no puede exceder {0} caracteres.

# Validation.LastNameInvalidChars
source: Last name contains invalid characters.
es_es: El apellido contiene caracteres inválidos.

# Validation.RoleRequired
source: Role is required.
es_es: El rol es obligatorio.

# Validation.InvalidRole
source: Invalid role. Must be one of: {0}.
es_es: Rol inválido. Debe ser uno de: {0}.

# Validation.DepartmentMaxLength
source: Department must not exceed {0} characters.
es_es: El departamento no puede exceder {0} caracteres.

# Validation.JobTitleMaxLength
source: Job title must not exceed {0} characters.
es_es: El título del trabajo no puede exceder {0} caracteres.

# Validation.UserIdRequired
source: User ID is required.
es_es: El ID de usuario es obligatorio.

# Validation.ProjectDataRequired
source: Project data is required.
es_es: Los datos del proyecto son obligatorios.

# Validation.ProjectNameRequired
source: Project name is required.
es_es: El nombre del proyecto es obligatorio.

# Validation.ProjectNameMaxLength
source: Project name must not exceed {0} characters.
es_es: El nombre del proyecto no puede exceder {0} caracteres.

# Validation.ProjectDescriptionRequired
source: Project description is required.
es_es: La descripción del proyecto es obligatoria.

# Validation.ProjectDescriptionMaxLength
source: Description must not exceed {0} characters.
es_es: La descripción no puede exceder {0} caracteres.

# Validation.InvalidProjectStatus
source: Invalid project status.
es_es: Estado del proyecto inválido.

# Validation.BudgetMustBePositive
source: Budget must be a positive value.
es_es: El presupuesto debe ser un valor positivo.

# Validation.PriorityRange
source: Priority must be between {0} and {1}.
es_es: La prioridad debe estar entre {0} y {1}.

# Validation.StartDateAfterEndDate
source: Start date must be before or equal to end date.
es_es: La fecha de inicio debe ser anterior o igual a la fecha de fin.

# Validation.ClientNameMaxLength
source: Client name must not exceed {0} characters.
es_es: El nombre del cliente no puede exceder {0} caracteres.

# Validation.TagsMaxLength
source: Tags must not exceed {0} characters.
es_es: Las etiquetas no pueden exceder {0} caracteres.

# Validation.TeamMemberIdsRequired
source: Team member IDs list is required.
es_es: La lista de IDs de miembros del equipo es obligatoria.

# Validation.AtLeastOneTeamMember
source: At least one team member is required.
es_es: Se requiere al menos un miembro del equipo.

# Validation.InvalidTeamMemberId
source: Invalid team member ID.
es_es: ID de miembro del equipo inválido.

# Validation.ValidationFailed
source: Validation failed.
es_es: La validación falló.

# Validation.UserRoleDataRequired
source: User role data is required.
es_es: Los datos del rol de usuario son obligatorios.

# Validation.UpdaterIdRequired
source: Updater ID is required.
es_es: El ID del actualizador es obligatorio.

# Validation.NewRoleRequired
source: New role is required.
es_es: El nuevo rol es obligatorio.

# Validation.CannotRemoveOwnAdminRole
source: Users cannot remove their own admin role.
es_es: Los usuarios no pueden quitar su propio rol de administrador.

# Validation.DeletedByRequired
source: DeletedBy is required.
es_es: EliminadoPor es obligatorio.

# Validation.InvitationDataRequired
source: Invitation data is required.
es_es: Los datos de la invitación son obligatorios.

# Validation.IntendedRoleRequired
source: Intended role is required.
es_es: El rol previsto es obligatorio.

# Validation.InviterIdRequired
source: Inviter ID is required.
es_es: El ID del invitador es obligatorio.

# Validation.ExpirationDaysRange
source: Expiration days must be between {0} and {1}.
es_es: Los días de expiración deben estar entre {0} y {1}.

# Validation.TempEmailNotAllowed
source: Temporary email addresses are not allowed.
es_es: No se permiten direcciones de email temporales.

# Validation.NotificationTitleRequired
source: Notification title is required.
es_es: El título de la notificación es obligatorio.

# Validation.TitleMaxLength
source: Title must not exceed {0} characters.
es_es: El título no puede exceder {0} caracteres.

# Validation.NotificationMessageRequired
source: Notification message is required.
es_es: El mensaje de la notificación es obligatorio.

# Validation.MessageMaxLength
source: Message must not exceed {0} characters.
es_es: El mensaje no puede exceder {0} caracteres.

# Validation.InvalidNotificationType
source: Invalid notification type.
es_es: Tipo de notificación inválido.

# Validation.ActionUrlMaxLength
source: Action URL must not exceed {0} characters.
es_es: La URL de acción no puede exceder {0} caracteres.

# Validation.InvalidActionUrl
source: Action URL must be a valid URL.
es_es: La URL de acción debe ser una URL válida.

# Validation.MetadataMaxLength
source: Metadata must not exceed {0} characters.
es_es: Los metadatos no pueden exceder {0} caracteres.

# Validation.InvalidJsonMetadata
source: Metadata must be valid JSON.
es_es: Los metadatos deben ser JSON válido.

# Notification.NewUser
source: New user {0} has joined the system.
es_es: El nuevo usuario {0} se ha unido al sistema.

# Notification.ProjectUpdate
source: Project {0} has been updated.
es_es: El proyecto {0} ha sido actualizado.

# Notification.SystemMaintenance
source: System maintenance is scheduled for {0}.
es_es: El mantenimiento del sistema está programado para {0}.
